{
  "hit[
      {"_score": 25.328983,
        "_type": "item",
        "_id": "prince_of_persia_boot",
        "_source": {
          "mediatype": ["software"],
          "downloads": [798],
          "description": ["prince of persia boot"],
          "collection": ["softwarelibrary_apple_games", "softwarelibrary_apple", "softwarelibrary"],
          "title": ["prince of persia boot"],
        },
        "_index": "prod-b-003",
      },
      {"_score": 25.328983, "_type": "item", "_id": "prince_of_persia_b", "_source": {"mediatype": ["software"], "downloads": [1035], "description": ["prince of persia b"], "collection": ["softwarelibrary_apple_games", "softwarelibrary_apple", "softwarelibrary"], "title": ["prince of persia b"]}, "_index": "prod-b-003"}, {"_score": 25.328983, "_type": "item", "_id": "prince_of_persia_1990", "_source": {"creatorSorter": ["jordan mechner"], "title": ["Prince of Persia"], "downloads": [6193], "mediatype": ["software"], "collection": ["softwarelibrary_msdos_games", "softwarelibrary_msdos", "stream_only", "softwarelibrary", "fav-zizzo", "fav-mario_fink", "fav-fronter", "fav-jkstarbn", "fav-nbussio", "fav-geekitty", "fav-arashjeneral", "fav-rapha_rabelo", "fav-the90sfreak", "fav-daniel_pereira", "fav-rikkieri", "fav-jay_pal", "fav-wojtas_81", "fav-sandshrew2", "fav-adrian6622", "fav-gregoriusmagnus", "fav-jatzer", "fav-reekel", "fav-rudyro", "fav-eletxo", "fav-nordrae", "fav-jdoucette", "fav-soulstray", "fav-zuto", "fav-itsasofer", "fav-stgdw", "fav-mallykat", "fav-andrinog", "fav-lfhomet", "fav-maciejlisck", "fav-dirule", "fav-theperilsofrosella", "fav-cryptorian_me", "fav-koctonpab", "fav-woody88", "fav-souther", "fav-rodpincha"], "subjectSorter": ["msdos", "game"]}, "_index": "prod-b-003"}, {"_score": 25.218664, "_type": "item", "_id": "prince_of_persia_a", "_source": {"mediatype": ["software"], "downloads": [1365], "description": ["prince of persia a"], "collection": ["softwarelibrary_apple_games", "softwarelibrary_apple", "softwarelibrary", "fav-aidanstr"], "title": ["prince of persia a"]}, "_index": "prod-b-003"}, {"_score": 25.218664, "_type": "item", "_id": "sg_Prince_of_Persia_1993_Broderbund_Tengen_US", "_source": {"creatorSorter": ["broderbund/tengen"], "description": ["Prince of Persia is a fantasy platform game, originally developed by Jordan Mechner and released in 1989 for the Apple II, that represented a great leap forward in the quality of animation seen in video games. After the original release on the Apple II, Prince of Persia was ported to a wide range of platforms. The game managed to surprise and captivate the player despite being at first glance, repetitive. This was achieved by interspersing intelligent puzzles and deadly traps all along the path the player-controlled Prince had to take to complete the game—all this packaged in fluid, lifelike motion. Prince of Persia influenced a sub-genre known as the cinematic platformer, which imitated the sprawling non-scrolling levels, fluid animation, and control style. The game is set in ancient Persia. While the sultan is fighting a war in a foreign land, his vizier Jaffar, a wizard, seizes power. Jaffar's only obstacle to the throne is the Sultan's daughter (although the game never specifically mentions how). Jaffar locks her in a tower and orders her, under threat of execution, to become his wife. The game's nameless protagonist, whom the Princess loves, is thrown into the palace dungeons. The player must lead the protagonist out of the dungeons and to the palace tower, defeating Jaffar and freeing the Princess in under 60 minutes. In addition to guards, various traps and dungeons, the protagonist is further hindered by his own doppelgänger, an apparition of his own self that is conjured out of a magic mirror. The main objective of the player is to complete the game within one hour. The player must lead the game protagonist out of a dungeon and into a tower. Doing so requires bypassing traps and fighting hostile swordsmen. The game consists of twelve stages (or levels). To complete a game, all twelve stages must be completed in one session. A game session may be saved and resumed at a later time only after level 3. The player has a health indicator that consists of a series of small red triangles. The player starts with three. Each time he is damaged (cut by sword, fallen from two floors of heights or hit by a falling rock), the player loses one of these indicators. There are small jars of red potion scattered throughout the game that restore one health indicator. There are also large jars of red potion that increase the maximum number of health indicators by one. If the player's health is reduced to zero, the protagonist dies. Subsequently, the game is restarted from the beginning of the stage in which the protagonist died but the timer will not reset to that point, effectively constituting a time penalty. There is no counter for the number of lives but dying too many times will eventually leave the player with very little time to complete the game. There are three types of traps that the player must bypass: Spike traps, deep pits (three or more levels deep) and guillotines. Getting caught or falling into each results in the instant death of the protagonist. In addition, there are gates that can be raised for a short period of time by having the protagonist stand on the activation trigger. The player must pass through the gates while they are open, avoiding locking triggers. Sometimes, there are various traps between an unlock trigger and a gate. Hostile swordsmen (Jaffar and his guards) are yet another obstacle. The player obtains a sword in the first stage, which he can use to fight these adversaries. The protagonist's sword maneuvers are limited: He can advance, back off, slash or parry. Enemy swordsmen also have a health indicator similar to that of the protagonist. Killing them involves slashing them until their health indicator is depleted. A unique trap encountered in stage four, which serves as a plot device, is a magic mirror, whose appearance is followed by an ominous musical tone. The protagonist is forced to jump through this mirror upon which his doppelganger emerges from the other side. This apparition later hinders the protagonist by throwing him into a dungeon. The protagonist cannot kill this apparition as they share lives; any damage inflicted upon one also hurts the other. Therefore, the protagonist must merge with his doppelganger. Computer Gaming World stated that the game package's claim that it \"breaks new ground with animation so uncannily human it must be seen to be believed\" was true. It concluded that Prince of Persia \"captures the feel of those great old adventure films ... a tremendous achievement\", and compared its impact on gaming to Star Wars on film. Despite critical acclaim, the game was initially a commercial failure in North America, where it had sold only 7,000 units each on the Apple II and IBM PC platforms by July 1990. It was when the game was released in Japan and Europe that year that it became a commercial success. In July 1990, the NEC PC-9801 version sold 10,000 units as soon as it was released in Japan. It was then ported to various different home computers and video game consoles, eventually selling 2 million units worldwide by the time its sequel Prince of Persia 2: The Shadow and the Flame (1993) was in production. Prince of Persia would go on to influence cinematic platformers such as Flashback as well as action-adventure games such as Tomb Raider. In 1991, the game was ranked the 12th best game of all time by Amiga Power."], "title": ["Prince of Persia"], "downloads": [3244], "mediatype": ["software"], "collection": ["sega_genesis_library", "stream_only", "consolelivingroom"]}, "_index": "prod-b-003"}, {"_score": 25.097538, "_type": "item", "_id": "PrinceOfPersia_479", "_source": {"creatorSorter": ["broderbund software"], "description": ["\"Seventeen years have I, Jaffar, served as Grand Vizier to the Sultan of Persia. Now the hour of my triumph is at hand. Already I sit on his throne, and soon I shall have his daughter as well the Princess, whose beauty is like the stars and the moon. Of course, I would never force myself upon this lovely creature. I shall give her a full hour to reach her own decision. She shall choose me of her own free will - or forfeit her life. And yet she clings to her fantasy of rescue. The object of her childish infatuation? A young adventurer - a nobody - who is now, on my orders, a prisoner in my dungeons. There will be no rescue. He shall never leave his prison alive. Even should he escape his cell, he could never survive the cunning traps and palace guards barring him from the Princess. Yet suppose by some succession of miracles he prevails over all these? Ah, then I would be obliged to use certain forces of my own. Enchantment? Black Magic? These are but words. I speak of mysteries. Mysteries that no man or woman can withstand. \""], "title": ["Prince of Persia Demo"], "downloads": [23867], "mediatype": ["software"], "collection": ["classicpcgames", "fav-nougaro11", "fav-lord_malvern", "fav-juambo", "fav-ibisandz", "fav-corle80", "fav-987645321", "fav-kraftwerk", "fav-megaboom", "fav-gerboa", "fav-markobre", "fav-gonagi", "fav-jomayma", "fav-bombarral76", "fav-troublemakerontour", "fav-borborbor", "fav-stickypickle", "fav-simocabi80", "fav-nhobis", "fav-purplelion", "fav-mistermaynard", "fav-worbukk", "fav-sorinabug", "fav-rlimagon", "fav-kugelblitz", "fav-ap1803", "fav-ianhona", "fav-ikozimus", "fav-raen1978", "fav-signorpalmer"], "num_reviews": [2], "subjectSorter": ["DOS games", "Vintage computer games", "Action games"]}, "_index": "prod-b-003"}],
    "total": 8106,
    "max_score": 25.328983,
  },
  "_shards": {"successful": 6, "failed": 0, "skipped": 0, "total": 6},
  "took": 2047,
  "timed_out": false,
}
